{"task_id": 603, "generated_code": "def get_ludic(n):\n    ludics = []\n    numbers = list(range(1, n+1))\n    idx = 0\n    while idx < len(numbers):\n        l = numbers[idx]\n        ludics.append(l)\n        numbers = [x for i, x in enumerate(numbers) if (i % l != 0) or (i == idx)]\n        idx += 1\n    return [x for x in ludics if x <= n]\n", "cause_of_error": "The list‐comprehension that is supposed to sieve out every l-th number is incorrect. By using zero-based indices and the condition (i % l != 0) or (i == idx), when l == 1 it keeps only the element at index 0 and discards everything else. In other words, removing every 1st item wipes out the rest of the list, so the loop terminates immediately with only [1]. The logic should remove every l-th element (using 1-based counting on the remaining list) rather than this flawed zero-based filter."}
{"task_id": 609, "generated_code": "def floor_Min(a, b, c):\n    return min((a + b) // 2, (b + c) // 2, (c + a) // 2)", "cause_of_error": "The implementation simply computes the minimum of the three pairwise floor averages: (a+b)//2, (b+c)//2, (c+a)//2. This formula does not match the required periodic function’s actual minimum value, as shown by the test case floor_Min(1,2,1): the code returns 1 but the expected result is 0. The logic is incorrect rather than a naming or syntax issue."}
{"task_id": 617, "generated_code": "def min_Jumps(a, b, d):\n    if d == 0:\n        return 0\n    max_jump = max(a, b)\n    min_jump = min(a, b)\n    if d == max_jump or d == min_jump:\n        return 1\n    if d < max_jump:\n        return 2\n    q, r = divmod(d, max_jump)\n    if r == 0:\n        return q\n    if r <= min_jump:\n        return q + 0.5\n    return q + 1", "cause_of_error": "The logic for handling the remainder after using as many max-length jumps as possible is flawed. Returning q + 0.5 when the leftover distance is ≤ the smaller jump doesn’t match the required jump counting and yields 2.5 for (3,4,11) instead of the expected 3.5. In other words, the greedy division plus a “half jump” trick is incorrect and fails the test case. The function name and syntax are correct, so this is a logical error in the jump-counting algorithm."}
{"task_id": 626, "generated_code": "def triangle_area(r):\n    if r < 0:\n        return -1\n    if r == 0:\n        return 0\n    return 2 * r * r\n", "cause_of_error": "The implementation uses the formula 2 * r * r for the triangle area, but for the largest triangle inscribed in a semicircle (a right triangle with diameter as the hypotenuse and height r), the correct area is (1/2)*(2r)*r = r^2. Thus it should return r*r instead of 2*r*r."}
{"task_id": 638, "generated_code": "def wind_chill(wind_speed, temperature):\n    return round(35.74 + 0.6215 * temperature - 35.75 * (wind_speed ** 0.16) + 0.4275 * temperature * (wind_speed ** 0.16))", "cause_of_error": "The implementation uses the standard NOAA wind-chill formula (35.74 + 0.6215T – 35.75·v^0.16 + 0.4275T·v^0.16 in Fahrenheit), but the sample test values do not match that formula’s results. There is a logical mismatch between the problem’s expected output and the chosen formula."}
{"task_id": 642, "generated_code": "def remove_similar_row(matrix):\n    return set(tuple(row) for row in matrix)", "cause_of_error": "The implementation simply converts each row list to a tuple and adds it to a set, so rows that contain the same pairs in a different order aren’t recognized as duplicates. It never normalizes or sorts the row elements (e.g. by sorting the two tuples or using an unordered collection) before deduplication, so similar rows with reversed order end up as distinct entries."}
{"task_id": 652, "generated_code": "def matrix_to_list(matrix):\n    col1 = []\n    col2 = []\n    for row in matrix:\n        for t in row:\n            col1.append(t[0])\n            col2.append(t[1])\n    return str((tuple(col1), tuple(col2)))", "cause_of_error": "The code correctly flattens the two columns into tuples but then wraps them in a Python tuple and calls str() on that, producing a string like \"((...),(...))\". The tests expect a string representation of a list containing two tuples (i.e. \"[(...),(...)]\") rather than a tuple. This is a logical formatting error in the return value rather than a syntax error or a misnamed function."}
{"task_id": 660, "generated_code": "def find_Points(l1, r1, l2, r2):\n    if l1 != r2:\n        return (l1, r2)\n    else:\n        return (r1, l2)", "cause_of_error": "The selection logic is flawed: it checks l1 against r2 and then returns (l1, r2) or (r1, l2), but this yields the tuple in the wrong order (for example, find_Points(5,10,1,5) returns (10,1) instead of the expected (1,10)). The branches should compare and pick endpoints so that the first element comes from the second range and the second from the first, avoiding equal values, but the current conditions and ordering are incorrect."}
{"task_id": 692, "generated_code": "def last_Two_Digits(n):\n    if n == 0 or n == 1:\n        return 1\n    if n == 2:\n        return 2\n    if n == 3:\n        return 6\n    if n == 4:\n        return 24\n    res = 1\n    count_2 = 0\n    count_5 = 0\n    for i in range(2, n + 1):\n        x = i\n        while x % 2 == 0:\n            x //= 2\n            count_2 += 1\n        while x % 5 == 0:\n            x //= 5\n            count_5 += 1\n        res = (res * x) % 100\n    for _ in range(count_2 - count_5):\n        res = (res * 2) % 100\n    return res", "cause_of_error": "The implementation is using the standard trick of stripping out factors of 2 and 5 to avoid trailing zeros and then reinserting the excess powers of 2, which is an algorithm for the last nonzero digit (or sometimes last few nonzero digits) of n!. It does not correctly compute n! mod 100 because it ignores the full effect of factors beyond single zeros and their cyclical behavior mod 100. As a result, for n=5 it computes 12 instead of 20 (5! = 120 → last two digits 20). The function name is correct and there are no syntax issues—this is purely a flawed algorithmic approach for the stated problem."}
{"task_id": 704, "generated_code": "def harmonic_sum(n):\n    return sum(1/i for i in range(1, n))", "cause_of_error": "The generator uses range(1, n), which iterates from 1 up to n-1, so it leaves out the 1/n term. The test cases expect the harmonic sum through n inclusive (range(1, n+1)). This off-by-one logic error causes the discrepancy."}
{"task_id": 712, "generated_code": "def remove_duplicate(lst):\n    seen = set()\n    result = []\n    for item in lst:\n        key = tuple(item) if isinstance(item, list) else item\n        if key not in seen:\n            seen.add(key)\n            result.append(item)\n    return result", "cause_of_error": "The implementation removes duplicates by preserving the first occurrence of each item, but the sample tests expect you to drop earlier duplicates and keep the last occurrence (hence [40] ends up at the end rather than the second position). This logical mismatch in how duplicates are filtered causes the wrong ordering in the result."}
{"task_id": 714, "generated_code": "def count_Fac(n):\n    count = 0\n    i = 2\n    while i * i <= n:\n        if n % i == 0:\n            count += 1\n            while n % i == 0:\n                n //= i\n        i += 1\n    if n > 1:\n        count += 1\n    return count", "cause_of_error": "The implementation correctly counts the number of distinct prime divisors of n, but the problem’s sample tests expect a different measure (“distinct power of prime factor”) that is not simply the count of distinct primes. For instance, count_Fac(24) with this code returns 2 (primes 2 and 3), but the sample asserts 3. This mismatch indicates a logical error in interpreting what should be counted rather than a trivial typo or syntax mistake."}
{"task_id": 738, "generated_code": "def geometric_sum(n):\n    return sum(1 / (2 ** i) for i in range(n))", "cause_of_error": "The implementation uses range(n) and thus sums 1/2^i for i from 0 to n-1, yielding n terms. According to the sample, geometric_sum(7) should include terms up to 1/2^7 (eight terms, i from 0 to 7), so the code is off by one in its loop bounds."}
{"task_id": 746, "generated_code": "def sector_area(r, angle):\n    if angle >= 360:\n        return None\n    from math import pi\n    return (pi * r * r * angle) / 180 / 2", "cause_of_error": "The implementation uses the true math.pi constant, but the sample outputs are based on the approximation pi=22/7. As a result, sector_area(4,45) computes 2*pi ≈ 6.2831853 instead of the expected 44/7 ≈ 6.2857143. This mismatch in the value of pi causes the tests to fail."}
{"task_id": 754, "generated_code": "def extract_index_list(a, b, c):\n    res = []\n    for i in range(min(len(a), len(b), len(c))):\n        if a[i] == b[i] == c[i]:\n            res.append(i)\n    return res", "cause_of_error": "The implementation is comparing elements at identical positions correctly, but it appends the index (i) to the result rather than the element value at that index. The problem’s sample tests expect the common elements themselves (e.g. 1 and 7), not their positions (1 and 6)."}
{"task_id": 777, "generated_code": "def find_Sum(arr, n):\n    from collections import Counter\n    count = Counter(arr)\n    return sum(x for x in arr if count[x] == 1)", "cause_of_error": "The implementation sums only those array elements that occur exactly once (count[x] == 1), but the sample tests actually require summing each distinct value exactly once (i.e. sum(set(arr))). In other words, the logic filters out all duplicates entirely instead of collapsing duplicates and summing unique values."}
{"task_id": 780, "generated_code": "def find_combinations(tuples):\n    result = []\n    n = len(tuples)\n    for i in range(n - 1):\n        for j in range(i + 1, n):\n            t1 = tuples[i]\n            t2 = tuples[j]\n            result.append((t1[0] + t2[0], t1[1] + t2[1]))\n            result.append((t2[0] + t1[0], t2[1] + t1[1]))\n    return result", "cause_of_error": "The implementation double-counts each pair because it appends both (t1+t2) and (t2+t1) even though addition is commutative and yields identical sums. This leads to duplicate entries and twice as many results as expected. The correct logic should append each unique pair exactly once."}
{"task_id": 793, "generated_code": "def last(arr, x, n):\n    pos = -1\n    for i in range(n):\n        if arr[i] == x:\n            pos = i\n    return pos", "cause_of_error": "The code uses the passed-in parameter n as the loop bound without checking that n actually matches len(arr). In test #3 the array has only 7 elements but n is given as 8, so arr[i] blows out of range. The logic would work if n were correct or if the code iterated over len(arr) instead, but as written it fails with an indexing error."}
{"task_id": 799, "generated_code": "def left_Rotate(n, d):\n    num_bits = n.bit_length()\n    d = d % num_bits if num_bits else 0\n    return ((n << d) | (n >> (num_bits - d))) & ((1 << num_bits) - 1) if num_bits else 0", "cause_of_error": "The implementation performs a circular rotation within the original bit length of n and masks the result, but the sample tests expect a simple left shift (n << d) without wrapping or masking back to the original bit width. The extra wrap-around and masking logic is incorrect for the given problem."}
{"task_id": 802, "generated_code": "def count_Rotation(arr, n):\n    low = 0\n    high = n - 1\n    while low <= high:\n        if arr[low] <= arr[high]:\n            return low\n        mid = (low + high) // 2\n        next_idx = (mid + 1) % n\n        prev_idx = (mid - 1 + n) % n\n        if arr[mid] <= arr[next_idx] and arr[mid] <= arr[prev_idx]:\n            return mid\n        elif arr[mid] <= arr[high]:\n            high = mid - 1\n        else:\n            low = mid + 1\n    return 0", "cause_of_error": "The binary‐search approach implemented finds the index of the minimum element in an ascending‐sorted, rotated array, which equals the rotation count. The first sample ([3,2,1]) is not an ascending‐sorted rotation, so the algorithm returns 2 (the true index of the minimum) rather than the expected 1. In other words, the logic is correct for its stated purpose (ascending rotations), but the provided test case violates that precondition."}
{"task_id": 840, "generated_code": "def Check_Solution(a, b, c):\n    if a == 0:\n        return \"No\"\n    D = b * b - 4 * a * c\n    if D < 0:\n        return \"No\"\n    sqrt_D = D ** 0.5\n    r1 = (-b + sqrt_D) / (2 * a)\n    r2 = (-b - sqrt_D) / (2 * a)\n    if abs(r1 + r2) < 1e-8 and abs(abs(r1) - abs(r2)) < 1e-8:\n        return \"Yes\"\n    return \"No\"\n", "cause_of_error": "The code prematurely rejects cases with D < 0 by returning \"No\", but the problem requires considering complex roots as well. For a=2, b=0, c=2 the roots are +i and -i which are equal in magnitude and opposite in sign, so the function should return \"Yes\" instead of rejecting based on a negative discriminant."}
{"task_id": 856, "generated_code": "def find_Min_Swaps(arr, n):\n    ones_pos = [i for i, v in enumerate(arr) if v == 1]\n    min_swaps = 0\n    for idx, pos in enumerate(ones_pos):\n        min_swaps += pos - idx\n    return min_swaps", "cause_of_error": "The algorithm collects positions of 1s and sums (pos – index) to count zeros before each 1, effectively computing the swaps to group all 1s at the front ([1,1,0,0] for the first test). But the problem asks to sort the array into [0,0,1,1], i.e. move 1s to the end. Minimum adjacent swaps for that ordering equal the total zeros to the right of each 1, not zeros to the left. Thus the logic is incorrect (it counts the wrong distances), even though the function name and syntax are fine."}
{"task_id": 882, "generated_code": "def parallelogram_perimeter(base, side):\n    return 2 * (base + side) * base", "cause_of_error": "The function multiplies the sum of base and side by both 2 and base, effectively computing 2*(base+side)*base instead of the correct perimeter formula 2*(base+side). This extra multiplication by base is a logical error."}
{"task_id": 890, "generated_code": "def find_Extra(a, b, n):\n    left, right = 0, n - 1\n    while left < right:\n        mid = (left + right) // 2\n        if mid < len(b) and a[mid] == b[mid]:\n            left = mid + 1\n        else:\n            right = mid\n    return left", "cause_of_error": "The binary search bounds are wrong. By initializing right to n-1 (where n is the length of the shorter array) the code never searches the position immediately after the last matching index, so it can’t detect an extra element at the end of the longer array. The correct upper bound should allow checking index n (or the length of the longer array minus one), not stop at n-1. This is a logical mistake, not a syntax or naming issue."}
{"task_id": 899, "generated_code": "def check(arr, n):\n    l, r = 0, n - 1\n    prev = float('-inf')\n    for _ in range(n):\n        if arr[l] <= arr[r]:\n            if arr[l] < prev:\n                return False\n            prev = arr[l]\n            l += 1\n        else:\n            if arr[r] < prev:\n                return False\n            prev = arr[r]\n            r -= 1\n    return True", "cause_of_error": "The implementation uses a simple greedy strategy that always picks the smaller of the two end elements and checks if the resulting sequence is non-decreasing. This logic fails on inputs like [3,2,1,2,3,4] because picking 3 first leads to a drop at the next step (2 < 3), even though a valid sequence exists by picking from the right end first. In other words, the algorithm’s greedy rule is incorrect for this problem."}
{"task_id": 903, "generated_code": "def count_Unset_Bits(n):\n    def count_set_bits(n):\n        if n == 0:\n            return 0\n        x = n.bit_length() - 1\n        bits_up_to_2x = x * (1 << (x - 1)) if x > 0 else 0\n        msb_2x_to_n = n - (1 << x) + 1\n        rest = count_set_bits(n - (1 << x))\n        return bits_up_to_2x + msb_2x_to_n + rest\n\n    total_bits = n * n.bit_length()\n    set_bits = count_set_bits(n)\n    return total_bits - set_bits\n", "cause_of_error": "The code incorrectly computes the total number of bits (set+unset) across all numbers from 1 to n as n * n.bit_length(), which assumes every integer up to n has the same bit-width as n. In reality smaller numbers use fewer bits, so you must sum each number’s bit_length or compute the total differently. The helper count_set_bits is fine, but the total_bits formula is logically wrong, leading to bad results."}
{"task_id": 910, "generated_code": "def check_date(day, month, year):\n    from datetime import datetime\n    try:\n        d = int(day)\n        m = int(month)\n        y = int(year)\n        datetime(y, m, d)\n        return True\n    except:\n        return False", "cause_of_error": "The code calls datetime(y, m, d) assuming the first argument is day and the second is month (i.e. datetime(year, month, day)), but the sample tests imply the inputs are reversed: the first parameter is treated as month and the second as day. Thus check_date(13,11,2002) yields datetime(2002,11,13) which is valid, but the test expects False because 13 is out of range for a month. The logic is simply flipped parameter order."}
{"task_id": 915, "generated_code": "def rearrange_numbs(arr):\n    pos = sorted(filter(lambda x: x > 0, arr))\n    neg = sorted(filter(lambda x: x < 0, arr), reverse=True)\n    return pos + neg", "cause_of_error": "The logic mistakes the required ordering of negative numbers. By using sorted(…, reverse=True) on the negatives, the code produces the least-negative values first (e.g. -1 before -10), but the sample outputs append the most-negative values first (e.g. -10 before -1). There’s no syntax error and the function name matches, so this is purely a logical inversion in how negatives are ordered."}
{"task_id": 916, "generated_code": "def find_triplet_array(arr, n, target_sum):\n    arr = arr[:n]\n    arr.sort()\n    for i in range(n - 2):\n        left = i + 1\n        right = n - 1\n        while left < right:\n            curr_sum = arr[i] + arr[left] + arr[right]\n            if curr_sum == target_sum:\n                return (arr[i], arr[left], arr[right])\n            elif curr_sum < target_sum:\n                left += 1\n            else:\n                right -= 1\n    return None", "cause_of_error": "The code sorts the array and then returns the triplet in sorted order, but the test cases expect the triplet in the original relative order (e.g., (4, 10, 8) rather than (4, 8, 10)). This logical mismatch in the required output ordering causes the tests to fail."}
{"task_id": 922, "generated_code": "def max_product(arr):\n    if len(arr) < 2:\n        return None\n    max1 = max2 = float('-inf')\n    min1 = min2 = float('inf')\n    for num in arr:\n        if num > max1:\n            max2 = max1\n            max1 = num\n        elif num > max2:\n            max2 = num\n        if num < min1:\n            min2 = min1\n            min1 = num\n        elif num < min2:\n            min2 = num\n    prod1 = max1 * max2\n    prod2 = min1 * min2\n    if prod1 >= prod2:\n        return (max2, max1)\n    else:\n        return (min1, min2)", "cause_of_error": "The algorithm correctly identifies the two largest and two smallest values and compares their products, but when the maximum product comes from the two smallest (negative) numbers it returns (min1, min2) i.e. (smallest, second smallest). The expected output orders the pair as (second smallest, smallest), so the tuple is reversed for the negative case."}
{"task_id": 939, "generated_code": "def sorted_models(lst):\n    return sorted(lst, key=lambda x: x['make'].lower(), reverse=False) if lst == sorted(lst, key=lambda x: x['make'].lower(), reverse=False) else sorted(lst, key=lambda x: x['make'].lower(), reverse=True)", "cause_of_error": "The implementation uses a conditional expression to check if the input list is already in ascending order and, if not, returns it in descending order. The problem only asks to sort the list in ascending order by the 'make' key; there is no requirement to toggle to descending order based on the input order. This logical branch makes the function behavior incorrect for any unsorted input."}
{"task_id": 944, "generated_code": "def num_position(s):\n    for idx, word in enumerate(s.split()):\n        if word.isdigit():\n            return idx + 1\n    return -1", "cause_of_error": "The implementation splits the string into words and returns the 1-based index of the numeric word, but the problem (and test cases) expects the 0-based character index where the number begins in the original string. This is a logical misinterpretation rather than a syntax or naming mistake."}
{"task_id": 952, "generated_code": "def nCr_mod_p(n, r, p):\n    if r < 0 or r > n:\n        return 0\n    if r == 0 or r == n:\n        return 1\n    r = min(r, n - r)\n    numer = 1\n    denom = 1\n    for i in range(r):\n        numer = (numer * (n - i)) % p\n        denom = (denom * (i + 1)) % p\n    def modinv(a, p):\n        return pow(a, p - 2, p)\n    return (numer * modinv(denom, p)) % p", "cause_of_error": "The implementation uses Fermat’s little theorem (pow(a, p-2, p)) to compute the modular inverse of denom, which only works when p is prime. One of the test cases uses p=14 (a composite), so the inverse calculation is invalid and yields the wrong result."}
{"task_id": 960, "generated_code": "def get_noOfways(n):\n    if n == 0 or n == 1:\n        return 1\n    dp = [0] * (n+1)\n    dp[0] = 1\n    dp[1] = 1\n    for i in range(2, n+1):\n        dp[i] = dp[i-1] + dp[i-2]\n    return dp[n]", "cause_of_error": "The DP recurrence is correct (dp[i] = dp[i-1] + dp[i-2]), but the base cases are wrong for this tiling problem. The code sets dp[0] = 1 and dp[1] = 1, which makes dp[3] = 3 and dp[4] = 5, whereas the sample tests expect get_noOfways(3) == 2 and get_noOfways(4) == 3. For tiling a 2×n board, the correct base cases are dp[1] = 1 and dp[2] = 2, so dp[3] = 2 and dp[4] = 3 as required by the tests. This is a logical error in how the sequence is initialized, not a syntax issue or a misnamed function."}
